new-mach-nosecone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    nosecone
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          101;
        startFace       11447;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       11548;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       11588;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          11616;
        startFace       11724;
    }
)

// ************************************************************************* //
